app/controllers/api/v1/tags_controller.rb

  def index
    render json: Tag.all.to_json
---
SELECT "tags".* FROM "tags"

  def show
    render json: Tag.find(params[:id]).to_json
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    if (tag = Tag.create(tag_params)) && tag.persisted?
---
INSERT INTO "tags" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Someday"], ["created_at", "2021-04-11 09:04:17.893958"], ["updated_at", "2021-04-11 09:04:17.893958"]]

  def update
    tag = Tag.find(params[:id])
    if tag.update_attributes(tag_params)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
UPDATE "tags" SET "title" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["title", "Updated Tag Title"], ["updated_at", "2021-04-11 09:10:39.413272"], ["id", 63]]