app/controllers/api/v1/tasks_controller.rb

  def index
    render json: Task.all.to_json
---
SELECT "tasks".* FROM "tasks"

  def show
    render json: Task.find(params[:id]).to_json
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 99], ["LIMIT", 1]]

  def create
    if (task = Task.create(create_params)) && task.persisted?
---
INSERT INTO "tasks" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Someday"], ["created_at", "2021-04-11 09:34:27.481838"], ["updated_at", "2021-04-11 09:34:27.481838"]]

    task = Task.find(params[:id])
    if task.update_attributes(update_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 99], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Updated Task Title"], ["updated_at", "2021-04-11 09:39:07.948431"], ["id", 7]]

    task = Task.find(params[:id])
    if task.destroy.destroyed?
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 44]]